cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Formulas
brew 'bat'
brew 'ffmpeg'
brew 'git'
<<<<<<< Updated upstream
brew 'gpg'
brew 'mackup'
brew 'mpv', args: ['with-bundle', 'with-libbluray']
=======
brew 'gnupg'
brew 'mas'
>>>>>>> Stashed changes
brew 'nvm'
brew 'yarn', args: ['without-node']
brew 'youtube-dl'
brew 'z'
brew 'zsh'

# Applications
cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'bartender'
cask 'bettertouchtool'
cask 'carbon-copy-cloner'
cask 'controlplane'
cask 'cookie'
cask 'daisydisk'
cask 'deluge'
cask 'docker'
<<<<<<< Updated upstream
cask 'dropbox'
=======
cask 'firefox'
>>>>>>> Stashed changes
cask 'force-paste'
cask 'github'
cask 'go2shell'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hazel'
cask 'imageoptim'
cask 'iterm2'
cask 'karabiner-elements'
cask 'little-snitch'
cask 'musicbrainz-picard'
cask 'paw'
cask 'scroll-reverser'
cask 'selfcontrol'
cask 'sensiblesidebuttons'
cask 'slack'
cask 'soda-player'
cask 'spotify'
cask 'there'
cask 'torbrowser'
cask 'transmission'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'viscosity'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'xld'

# Mac App Store
mas '1Blocker for Safari', id: 1107421413
mas 'Black Out', id: 1319884285
mas 'Deliveries', id: 924726344
mas 'Gestimer', id: 990588172
mas 'iA Writer', id: 775737590
mas 'Keynote', id: 409183694
mas 'Lungo', id: 1263070803
mas 'MindNode – Mind Map', id: 1289197285
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Radium', id: 597611879
mas 'ReadKit', id: 588726889
mas 'Sip', id: 507257563
mas 'The Unarchiver', id: 425424353
mas 'Things 3', id: 904280696
mas 'Tweetbot', id: 557168941
# mas 'Xcode', id: 497799835 # Leave this out as it triggers having to accept the license
mas 'Yoink', id: 457622435

# QuickLook plugins
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
